blog/2013/12/05/malloc2/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>More about Malloc in C - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="&lt;TODO: insert your description here&gt;" />
  <meta name="keywords" content="c, malloc" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="as_sitesearch" value="guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>More about Malloc in C</h1>
  <style type="text/css">
pre.src-C {
    background-color: black !important;
    font-weight: bolder !important;
}

b:before, b:after, strong:before, strong:after {
    content: "";
}

i:before, i:after, em:before, em:after {
    content: "";
}
</style>

<p>
上一节课我们讨论了malloc是如何在堆中维护一个大的内存缓冲区的，当用户调用 <b>malloc()</b> 的时候它会累积和分配内存。如果内存缓冲区中所剩的内存不足以满足用户申请的，则会调用 <b>sbrk()</b> 为堆分配足够大的缓冲区。
</p>

<p>
事实上 <b>Malloc</b> 的工作方式不太一样。它真正做的事情是维护一个未分配内存的链接。当 <b>malloc()</b> 被调用时，它会查找链接找出足够大的内存块。如果找到了，便把那块内存从链接中删除，并且把内存块返回给用户。这就是 <b>malloc()</b> 的标准工作方式 -- 它管理一示分配内存的链接。 <b>Malloc()</b> 从链接表获取内存并且返回给用户， *free()*则把内存还给链接。
</p>

<p>
初始时，内存链接是空的。当第一次调用 <b>malloc()</b> 时，它会调用 <b>sbrk()</b> 从系统获取内存并使用链表维护。我们会不断地从这整块内存中取出部分部足用户申请，剩下的放在链表中。
</p>

<p>
在讲示例之前，我先讲讲链表的实现方式。首先有一个全局变量 <b>malloc_head</b> ，它指向链表头。刚开始 <b>malloc_head</b> 值为 <b>NULL</b> ，当 <b>malloc()</b> 第一次被调用时， <b>sbrk()</b> 被调用申请内存使用链表维护。具体做法是，使用少量字节标记链表结构。换句话说，如果你在链接中有一块内存，且这块内存至少有12字节大小， 那么你可以把这块内存的前12个字节用来描述链表结构。如：
</p>

<ul class="org-ul">
<li>字节0-3：整数 -- 这块内存的大小
</li>
<li>字节4-7：指向链表下一块内存的指针
</li>
<li>字节8-11：指向链表上一块内存的指针
</li>
</ul>

<p>
你会怎么做呢？你会像下向这样创建一个类型定义：
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">flist</span> {
   <span style="color: #228b22;">int</span> <span style="color: #a0522d;">size</span>;
   <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">flist</span> *<span style="color: #a0522d;">flink</span>;
   <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">flist</span> *<span style="color: #a0522d;">blink</span>;
} *<span style="color: #228b22;">Flist</span>;
</pre>
</div>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
